In [1]:
import sqlite3

In [2]:
sqlite3.version

'2.6.0'

In [4]:
sqlite3.sqlite_version

'3.36.0'

In [5]:
conn = sqlite3.connect("employee.db")

cur = conn.cursor()

conn.execute('CREATE TABLE employee_data(id INTEGER, name TEXT, nickname TEXT, department TEXT, employment_date TEXT)')

cur.executemany(
    'INSERT INTO employee_data VALUES (?, ?, ?, ?, ?)',
    [(1001, 'Donghyun', 'SOMJANG', 'Development', '2020-04-01 00:00:00.000'),
     (2001, 'Sol', 'Fairy', 'Marketing', '2020-04-01 00:00:00.000'),
     (2002, 'Jiyoung', 'Magician', 'Marketing', '2020-04-01 00:00:00.000'),
     (1002, 'Hyeona', 'Theif', 'Development', '2020-04-01 00:00:00.000'),
     (1003, 'Soyoung', 'Chief', 'Development', '2020-04-01 00:00:00.000')
    ]
)


conn.commit()
conn.close()

In [7]:
conn = sqlite3.connect("employee.db")

cur = conn.cursor()

cur.execute("SELECT * FROM employee_data")

rows = cur.fetchall()

for row in rows:
    print(row)
    
conn.close()

(1001, 'Donghyun', 'SOMJANG', 'Development', '2020-04-01 00:00:00.000')
(2001, 'Sol', 'Fairy', 'Marketing', '2020-04-01 00:00:00.000')
(2002, 'Jiyoung', 'Magician', 'Marketing', '2020-04-01 00:00:00.000')
(1002, 'Hyeona', 'Theif', 'Development', '2020-04-01 00:00:00.000')
(1003, 'Soyoung', 'Chief', 'Development', '2020-04-01 00:00:00.000')

In [8]:
conn.close()

In [9]:
import pandas as pd

conn = sqlite3.connect("employee.db")

cur = conn.cursor()

cur.execute("SELECT * FROM employee_data")

rows = cur.fetchall()

cols = [column[0] for column in cur.description]

data_df = pd.DataFrame.from_records(data=rows, columns=cols)

conn.close()

data_df

     id      name  nickname   department          employment_date
0  1001  Donghyun   SOMJANG  Development  2020-04-01 00:00:00.000
1  2001       Sol     Fairy    Marketing  2020-04-01 00:00:00.000
2  2002   Jiyoung  Magician    Marketing  2020-04-01 00:00:00.000
3  1002    Hyeona     Theif  Development  2020-04-01 00:00:00.000
4  1003   Soyoung     Chief  Development  2020-04-01 00:00:00.000